from pymongo import MongoClient

db_url = 'mongodb://192.168.0.179:27017'

with MongoClient(db_url) as client:    
    client['mydb']['local_latlon'].delete_many({})    
        dic_latlng = {
                    '강원도':[37.8662751,127.6873312],
                    '경기도':[37.5980832,126.5354804],
                    '경상남도':[35.1813852,127.8306156],
                    '경상북도':[36.5566151,128.7245517],
                    '광주광역시':[35.1768202,126.7737602],
                    '대구광역시':[35.8798688,128.4966602],
                    '서울특별시':[37.5640455,126.8340028],
                    '울산광역시':[35.5621694,129.2814602],
                    '인천광역시':[37.4646656,126.6043102],
                    '전라남도':[34.6959784,125.9375858],
                    '전라북도':[35.7273993,126.3695896],
                    '제주특별자치도':[33.5784808,126.2928457],
                    '충청남도':[36.5371391,126.2334],
                    '충청북도':[36.6371934,127.4064704]
    }
    client['mydb']['local_latlon'].insert_one(dic_latlng)
    
        




